# MultistoryStairsHideTopLevelParameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..MultistoryStairsHideTopLevelParameter Property
BuiltInFailures..::..StairRampFailures Class See Also
---
You have set the stair's multistory top level to None, and Revit will remove this parameter, if you want to create a multistory stair, please use Create Multistory Stair feature.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MultistoryStairsHideTopLevelParameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultistoryStairsHideTopLevelParameter As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MultistoryStairsHideTopLevelParameter {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace